const data = [
  {
    title: "វិធីដេកដែលមានប្រសិទ្ធភាព",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/chhay.jpg",
    author: "ឌី គីមឆាយ",
  },
  {
    title: "ដេកល្អជួយឲ្យខួរក្បាលស្រស់",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/chhay01.jpg",
    author: "ឌី គីមឆាយ",
  },
  {
    title: "សម្រាកយប់យ៉ាងមានគុណភាព",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/hour.jpg",
    author: "លី ម៉េងហួ",
  },
  {
    title: "ទម្លាប់គេងសម្រាប់សុខភាពល្អ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/kiry.jpg",
    author: "ណូត គិរី",
  },
  {
    title: "ដេកល្អដើម្បីការងារប្រសើរ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/leng01.jpg",
    author: "ប៊ុនធី គឹមឡេង",
  },
  {
    title: "ការដេកសម្រាប់ជីវិតល្អប្រសើរ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/nha01.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "គេងត្រឹមត្រូវគឺជាសុខភាពល្អ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/nha02.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "រៀបចំការគេងឲ្យបានល្អប្រសើរ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/nha03.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "គេងល្អដើម្បីមានថាមពលពេញថ្ងៃ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/nha04.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "ចិត្តស្ងប់ស្ងៀមសម្រាប់ដេកល្អ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/nha05.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "ដេកល្អជួយពង្រឹងប្រព័ន្ធភ្លើង",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/nha06.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "ការដេកមានប្រសិទ្ធភាពខ្ពស់",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/nha07.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "គេងល្អជាគន្លឹះនៃជីវិតល្អ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/panha.jpg",
    author: "ផល ឧត្តមបញ្ញា",
  },
  {
    title: "ការដេកល្អសម្រាប់សុខភាពផ្លូវចិត្ត",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/sang.jpg",
    author: "អ៊ូច សាំង",
  },
  {
    title: "ទម្រង់បើកភ្លើងបៃតង",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/teng.jpg",
    author: "តេង បញ្ញា",
  },
  {
    title: "របៀបដេកសម្រាប់ភាពរីកចម្រើន",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/vannda.jpg",
    author: "គង់ សុវណ្ណដា",
  },
  {
    title: "គេងយ៉ាងល្អសម្រាប់ការរំលឹកល្អ",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/vannda01.jpg",
    author: "គង់ សុវណ្ណដា",
  },
  {
    title: "សម្រាកយប់សម្រាប់ការយល់ច្បាស់",
    des: "សង្ខេបពីការរៀបចំបរិយាកាស និងទម្លាប់ឲ្យដេកមានគុណភាព ដើម្បីទទួលបានសុខភាពល្អ និងថាមពលពេញខួរក្បាល។",
    img: "images/vannda02.jpg",
    author: "គង់ សុវណ្ណដា",
  },
];

let dataCard = "";
for (i = 0; i < data.length; i++) {
  dataCard += `
<div class="flex flex-col bg-white border border-gray-200 shadow-2xs rounded-xl overflow-hidden">
            <figure class="h-[200px] w-full overflow-hidden flex justify-center items-center bg-gray-100">
                <img class="object-cover w-full h-full" src="${data[i].img}" alt="Card Image">
            </figure>
            <div class="p-4 md:p-5">
                <h3 class="text-lg font-bold text-gray-800">
                    ${data[i].title}</p>
                </h3>
                <p class="mt-1 text-gray-500">
                    ${data[i].des}
                </p>
                <p class="mt-5 text-xs text-gray-500">
                    សិល្បករៈ ${data[i].author}
                </p>
            </div>
        </div>
`;
}

document.getElementById("cardContainer").innerHTML = dataCard;
